{
    "url": "https://www.theverge.com/news/622380/lenovo-thinkbook-flip-concept-laptop-foldable-mwc",
    "title": "The Verge",
    "content": "Lenovo has another funky experiment it’s announcing at Mobile World Congress : the ThinkBook “codename Flip” AI PC Concept. It’s a productivity / business laptop with a flexible display, allowing it to be used as a traditional 13.1-inch clamshell, a folded-up 12.9-inch tablet, or a laptop with an extra-tall 18.1-inch vertical screen. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. If you do not allow these cookies you may not be able to use or see these sharing tools. Targeting Cookies Switch Label These cookies may be set through our site by our advertising partners. In addition to being able to view long documents and websites, it puts the webcam and top portion of the screen at a pleasing and neck-relieving eye level. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. Menu Expand News Lenovo’s ThinkBook Flip puts an extra-tall folding display on a laptop Lenovo keeps finding new ways to stuff huge screens into otherwise plain productivity laptops. He spent over 15 years in the photography industry before joining The Verge as a deals writer in 2021. Cookie Policy Vendor List Allow All Manage Consent Preferences Strictly Necessary Cookies Essential These cookies are necessary for the website to function and cannot be switched off in our systems. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. SUBSCRIBE NOW. Subscribe for full access to our reviews, scoops, and analysis. They can transform the trackpad into a number pad, offer shortcuts to functions like the Snipping Tool or a mute button for your mic, or serve as an app launcher. Lenovo keeps finding new ways to stuff huge screens into otherwise plain productivity laptops. The basic illuminated icons offered a fair compromise. Di Benedetto Photography by Allison Johnson / The Verge Mar 2, 2025, 1:00 PM HAST Link Facebook Threads 20 Comments / 20 New Antonio G. They help us to know which pages are the most and least popular and see how visitors move around the site. They may be set by us or by third party providers whose services we have added to our pages. Functional Cookies Essential These cookies enable the website to provide enhanced functionality and personalisation. Click on the different category headings to find out more and change our default settings according to your preference. If you do not allow these cookies then some or all of these services may not function properly. There’s always a chance that this concept never goes beyond the prototype phase, but since it’s borrowing components from the ThinkBook Plus Gen 6, the odds may be in its favor. But my colleague Allison Johnson saw another prototype of the Flip in Barcelona at MWC that already looked a little further along and less janky. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. Skip to main content The homepage The Verge The Verge logo. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. These cookies do not store any personally identifiable information. You can opt-out of the sharing of your personal information by using this toggle switch. All information these cookies collect is aggregated and therefore anonymous. You cannot opt-out of our First Party Strictly Necessary Cookies as they are deployed in order to ensure the proper functioning of our website (such as prompting the cookie banner and remembering your settings, to log into your account, to redirect you when you log out, etc.). While the Flip is still in the concept phase, Lenovo does have some estimated specs for what would go inside, which seems like a promising sign this laptop will actually come to market. For more information on your rights and options see our privacy notice. View Vendor Details‎ Back Button Vendors List Search Icon Filter Icon Clear checkbox label label Apply Cancel Consent Leg.Interest checkbox label label checkbox label label checkbox label label Confirm My Choices Don't miss the big ones. Subscribe Sign In The homepage The Verge The Verge logo. It was far from the ready-to-ship rollable ThinkBook Plus Gen 6 I saw at CES, which I didn’t have to treat so delicately. This may impact the content and messages you see on other websites you visit. Advertiser Content From This is the title for the native ad More in News Major publishers call on the US government to ‘Stop AI Theft’ The White House’s group chat screwup is even more ridiculous than we thought Nintendo’s Switch 2 upgrade packs for Zelda will cost $9.99 GM’s UK design team imagines an electrified Corvette Google’s AI Mode can now see and search with images Death Stranding movie nabs director of Pig and A Quiet Place: Day One Major publishers call on the US government to ‘Stop AI Theft’ Emma Roth Two hours ago Comments Comment Icon Bubble 5 The White House’s group chat screwup is even more ridiculous than we thought Wes Davis 7:54 AM HADT Comments Comment Icon Bubble 26 Nintendo’s Switch 2 upgrade packs for Zelda will cost $9.99 Ash Parrish 7:13 AM HADT Comments Comment Icon Bubble 13 GM’s UK design team imagines an electrified Corvette Umar Shakir 7:02 AM HADT Comments Comment Icon Bubble 3 Google’s AI Mode can now see and search with images Jess Weatherbed 7:00 AM HADT Comments Comment Icon Bubble 3 Death Stranding movie nabs director of Pig and A Quiet Place: Day One Ash Parrish 6:33 AM HADT Comments Comment Icon Bubble 1 Advertiser Content From This is the title for the native ad Top Stories 4:04 AM HADT Nintendo boss on Switch 2 and tariffs: ‘we are actively assessing what the impact may be’ 13 minutes ago Microsoft fires employee protestor who called AI boss a ‘war profiteer’ 5:00 AM HADT The rise of ‘Frankenstein’ laptops in New Delhi’s repair markets Apr 6 ‘Hands Off’: Protesters deliver a sweeping message to Trump and Musk at a DC rally 7:00 AM HADT The Last of Us season 2 is a brutal, bloody expansion of the game 6:30 AM HADT 22 years later, modders are keeping SimCity 4 alive reCAPTCHA Recaptcha requires verification. When folded back, the Flip can be used like a normal 13-inch clamshell laptop, albeit with nearly half its screen facing backward. Di Benedetto is a reviewer covering laptops and the occasional gadget. They are capable of tracking your browser across other sites and building up a profile of your interests. The ThinkBook Flip uses the same OLED panel as the $3,500 ThinkBook Plus Gen 6 that’s expected to arrive sometime in June — only here, it’s set up to fold behind the main portion of the screen instead of extend out from underneath it. The Flip may make sense as an alternate offering if its lack of motors means it can be offered at a lower price than its rollable cousin. View Vendor Details‎ Opt Out of Sale or Sharing/Targeted Advertising Opt Out of Sale or Sharing/Targeted Advertising As a valued user, we are providing you the ability to opt-out from the sharing of your personal information to advertisers and social media companies at any time across business platform, services, businesses and devices. 20 Comments / 20 New See More : Laptops Lenovo News Tech More in this stream See all MWC 2025 was all about the odds and ends Allison Johnson Mar 7 Comments Comment Icon Bubble 4 The best stuff we’ve seen at MWC so far Andrew Liszewski Mar 5 Comments Comment Icon Bubble 7 This little AI phone has some wild ideas Allison Johnson Mar 5 Comments Comment Icon Bubble 15 Most Popular Most Popular Nintendo says tariffs aren’t the reason the Switch 2 costs $449.99 One streaming app to (almost) rule them all Microsoft has created an AI-generated version of Quake Trump’s new tariff math looks a lot like ChatGPT’s The rise of ‘Frankenstein’ laptops in New Delhi’s repair markets Installer A weekly newsletter by David Pierce designed to tell you everything you need to download, watch, read, listen to, and explore that fits in The Verge’s universe. However, you can choose not to allow certain types of cookies, which may impact your experience of the site and the services we are able to offer. It offers three color-coded layers of LED-illuminated touch shortcuts and media controls you can call up within the pad itself. The ThinkBook Flip I got to see in a brief demo ahead of MWC was an early prototype that still felt fragile and a little rough around the edges. I know I personally always want to see more funky laptops, and it’d be cool to get multiple flavors of these tall boys. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . Privacy - Terms protected by reCAPTCHA Privacy - Terms Your Opt Out Preference Signal is Honored Privacy Center When you visit our website, we store cookies on your browser to collect information. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. TikTok Embed verge The Verge View profile 246 12 38 Watch more exciting videos on TikTok Watch more exciting videos on TikTok Watch more exciting videos on TikTok Watch now @verge Lenovo is demo’ing a foldable laptop screen concept that lets you to ...See more original sound - The Verge L e n o v o i s d e m o ’ i n g a f o l d a b l e l a p t o p s c r e e n c o n c e p t t h a t l e t s y o u t o ...See more Outside of its screen, the Flip’s other unique feature is its Smart ForcePad trackpad. Performance Cookies Essential These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. Samuel Shang, principal researcher of Lenovo Research, told me the company’s dream setup would be to replace the touchpad with a smartphone display, but that would be too costly. But the real star of the show is when you flip the screen up to get all 18.1 inches / 2000 x 2664 resolution of glorious OLED for yourself. by Antonio G. The information collected might relate to you, your preferences or your device, and is mostly used to make the site work as you expect it to and to provide a more personalized web experience. Social Media Cookies Switch Label These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. It’ll use an Intel Ultra 7 processor, 32GB of LPDDR5X RAM, PCIe SSD storage, Thunderbolt 4 ports, and feature a fingerprint reader. You can use that rear-facing portion to mirror or extend your display and present to someone else without the need for an external monitor or projector, or just leave it blank. For more information about the First and Third Party Cookies used please follow this link. That means there are no motors, which could bring costs down, and none of the display is left sitting unused inside the chassis — hence the Flip’s 0.4 inches of extra screen real estate over the Gen 6",
    "images": {
        "images\\257550_Lenovo_MWC_AJohnson_0009.jpg": "The image shows a laptop displaying a webpage with various news articles. The laptop is open on a dark purple surface, and there is another laptop visible in the background. The webpage appears to be in Spanish, with articles about current events, technology, and possibly finance.\n",
        "images\\ANTONIO_DI_BENEDETTO.0.jpg": "This image appears to be a portrait of a man with long hair. The image has a blue tint or filter applied to it. \n",
        "images\\7318972437738520619~tplv-tiktokx-cropcenter_100_100.jpeg": "Based on the image, it appears to be the logo for **Venture**. \n",
        "images\\257550_Lenovo_MWC_AJohnson_0007.jpg": "The image is of a laptop. The screen is displaying a web browser with multiple windows open, including a calculator. The laptop appears to be on a purple surface. There is another laptop visible on the left side of the frame. The background is a gradient of purple.\n"
    }
}